# Написать список имен, вывести только женские имена

list_name = ['Svetlana', 'Anton', 'Matthew', 'Jessica', 'Amanda']
print(list_name[0], list_name[3], list_name[4])

# написать генератор списка, который создаст список только из нечетных чисел
a = [i for i in range(1, 100, 2)]
print(a)
