






# Сделать функцию поиска минимума и максимума в списке.


'''Написать функцию, которая определяет, является ли год високосным. Пользователь
вводит год, если он високосный, то функция возвращает True. Если нет, то False.'''


'''Написать функцию season, принимающую 1 аргумент — номер месяца (от 1 до 12), и 
возвращающую время года, которому этот месяц принадлежит (зима, весна, лето или осень).'''


'''Написать функцию date, принимающую 3 аргумента — день, месяц и год. Вернуть True, 
если такая дата есть в нашем календаре, и False иначе.* '''


'''Список [16, -17, 2, 78.7, False, False, {‘True’: True}, 555, 12, 23, 42, ‘DD’] Функция, 
принимает на вход список -выбирает из него все int и float -составить из него новый 
список, отсортированный от наименьшего значения большему'''

